1. 아래와 같이 데이터 프레임을 만드시오

In [36]:
import pandas as pd
dd = pd.DataFrame(
                   data = {'Names':['Bob', 'Jessica', 'Mary', 'John', 'Mel'],
                           'Births':[968,155,77,578,973]})
dd

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

2. 하나의 열을 선택하시오

In [37]:
dd['Names']

0        Bob
1    Jessica
2       Mary
3       John
4        Mel
Name: Names, dtype: object

3. 0~3번째 인덱스를 선택하세요

In [38]:
dd.loc[:3]

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578

4. Births 열이 100보다 큰 데이터를 선택해 보세요

In [39]:
dd[dd['Births']>100]

     Names  Births
0      Bob     968
1  Jessica     155
3     John     578
4      Mel     973

5. 평균값을 계산해 보세요.

In [40]:
dd['Births'].mean()

550.2